export const titles = {
    'AllSuperheroes': 'Всички създадени герои',
    'TopHeroes': 'Най-харесвани',
    'Create': 'Създаване на герой',
    'Edit': 'Редактиране на герой',
    'Details': 'Детайли за героя',
    'Likes': 'Харесвания',
    'MyHeroes': 'Всички мои герои',
    'Login': 'Вход',
    'Register': 'Нов профил',
    'Welcome': 'Добре дошли'

}

export const alertMessages = {
    'NoSuperheroes': 'Все още няма създадени герои...',
    'SomethingWentWrong': 'Нещо се обърка...',
    'LikesSuccess': 'Успешно харесахте този герой',
    'LikesDuplicate': 'Вече сте харесали този герой',
    'LoginSuccess': 'Успешно влязохте в профила си',
    'LoginDenied': 'Възникна проблем с влизането',
    'LogoutSuccess': 'Успешно излязохте от профила си',
    'LogoutDenied': 'Възникна проблем с излизането от профила',
    'NoProfileMessage': 'Нямате профил? Просто натиснете тук',
    'HasProfileMessage': 'Вече имате профил? Просто натиснете тук',
    'EditSuccess': 'Успешно редактирахте героя',
    'EditDenied': 'Възникна проблем с редактирането на героя',
    'CreateSuccess': 'Успешно създадохте нов герой',
    'CreateDenied': 'Възникна проблес със създаването на герой',
    'DeleteSuccess': 'Успешно изтрихте този герой',
    'DeleteDenied': 'Възникна проблем с изтриването на героя',
}

export const validationMessages = {
    'EmailRegex': 'Имейлът трябва да бъде във формат example@gmail.com',
    'PasswordLength': 'Паролата трябва да е между 6 и 20 символа',
    'PasswordSymbols': 'Паролата трябва да се състои само от латински букви и цифри',

    'PersonNameLength': 'Рожденото име трябва да е между 3 и 30 символа',
    'HeroNameLength': 'Героичното име трябва да е между 3 и 30 символа',
    'AgeRange': 'Годините трябва да са положително число',
    'StoryRange': 'Историята трябва да бъде между 10 и 500 символа',
    'StorySymbols': 'Историята може да се състои само от латински букви, цифри и/или символите:( . , ? ! - % / )',
    'ImageRegex': 'Адресът на изображението трябва да започва с протокол http/https',
    'ImageSize': 'Изображението трябва да бъде най-много 10МВ',

    'HeroNameRequired': 'Героичното име е задължително',
    'StoryRequired': 'Историята е задължителна',
    'ImageRequired': 'Изображението е задължителна',
}