export const titles = {
    'AllSuperheroes': 'Всички създадени герои',
    'AllComics': 'Всички създадени комикси',
    'TopHeroes': 'Най-харесвани',
    'Create': 'Създаване на нов',
    'Edit': 'Редактиране',
    'Details': 'Детайли',
    'Likes': 'Харесвания',
    'MyHeroes': 'Всички мои герои',
    'Pending': 'Герои, очакващи одобрение',
    'Login': 'Вход',
    'Register': 'Нов профил',
    'Welcome': 'Добре дошли в комиксовия свят на България!'

}

export const alertMessages = {
    'NoSuperheroes': 'Все още няма създадени герои...',
    'NoComics': 'Все още няма създадени комикси...',
    'SomethingWentWrong': 'Нещо се обърка...',
    'LikesSuccess': 'Успешно харесахте!',
    'ReportsSuccess': 'Успешно сигнализирахте!',
    'LikesDenied': 'Възникна проблем с харесването!',
    'ReportsDenied': 'Възникна проблем със сигнализирането!',
    'LikesDuplicate': 'Вече сте харесали този герой!',
    'LoginSuccess': 'Успешно влязохте в профила си!',
    'LoginDenied': 'Възникна проблем с влизането!',
    'RegisterSuccess': 'Успешно се регистрирахте в профила си!',
    'RegisterDenied': 'Възникна проблем с регистрацията!',
    'LogoutSuccess': 'Успешно излязохте от профила си!',
    'LogoutDenied': 'Възникна проблем с излизането от профила!',
    'NoProfileMessage': 'Нямате профил? Просто натиснете тук',
    'HasProfileMessage': 'Вече имате профил? Просто натиснете тук',
    'EditSuccess': 'Успешно редактирахте героя!',
    'EditDenied': 'Възникна проблем с редактирането на героя!',
    'CreateSuccess': 'Успешно създадохте нов герой!',
    'CreateDenied': 'Възникна проблем със създаването на нов герой!',
    'DeleteSuccess': 'Успешно изтрихте този герой!',
    'DeleteDenied': 'Възникна проблем с изтриването на героя!',
    'DeleteConfirm': 'Сигурни ли сте, че искате да изтриете този герой?',
    'EnteredInvalidData': 'Моля въведете валидни данни!',
    'EnteredNoData': 'Моля попълнете формата!',
    'Pending': 'Чака преглед...',
    'Approved': 'Одобрен!',
    'Declined': 'Изисква се редакция!'
}

export const validationMessages = {
    'EmailRegex': 'Имейлът не е валиден',
    'PasswordLength': 'Паролата трябва да е между 6 и 20 символа',
    'PasswordSymbols': 'Паролата трябва да се състои само от латински букви и цифри',
    'PasswordMissmatch': 'Паролите не съвпадат',

    'PersonNameLength': 'Рожденото име трябва да е между 3 и 30 символа',
    'HeroNameLength': 'Псевдонимът трябва да е между 3 и 30 символа',
    'KindLength': 'Расата трябва да е между 2 и 15 символа',
    'AgeRange': 'Годините трябва да са положително число',
    'StoryRange': 'Историята трябва да бъде поне 10',
    'ImageRegex': 'Адресът на изображението трябва да започва с протокол http/https',
    'ImageSize': 'Изображението трябва да бъде най-много 10МВ',

    'requiredMessage': 'Полето е задължително',
}